In [1]:
import numpy as np
import pandas as pd

##1. Create a sample JSON object from titanic dataset

https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv

In [2]:
csvObj = pd.read_csv('https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv')
csvObj.head()
#type(csvObj)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:

jsonObj = csvObj.head(20).to_json(orient='split')
jsonObj
#type(jsonObj)

'{"columns":["survived","pclass","name","sex","age","sibsp","parch","ticket","fare","cabin","embarked"],"index":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19],"data":[[0,3,"Braund, Mr. Owen Harris","male",22.0,1,0,"A\\/5 21171",7.25,null,"S"],[1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)","female",38.0,1,0,"PC 17599",71.2833,"C85","C"],[1,3,"Heikkinen, Miss. Laina","female",26.0,0,0,"STON\\/O2. 3101282",7.925,null,"S"],[1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)","female",35.0,1,0,"113803",53.1,"C123","S"],[0,3,"Allen, Mr. William Henry","male",35.0,0,0,"373450",8.05,null,"S"],[0,3,"Moran, Mr. James","male",null,0,0,"330877",8.4583,null,"Q"],[0,1,"McCarthy, Mr. Timothy J","male",54.0,0,0,"17463",51.8625,"E46","S"],[0,3,"Palsson, Master. Gosta Leonard","male",2.0,3,1,"349909",21.075,null,"S"],[1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","female",27.0,0,2,"347742",11.1333,null,"S"],[1,2,"Nasser, Mrs. Nicholas (Adele Achem)","female",14.0,1,0,"237736",30.0708,null,"C"],[1,3,"Sandstrom, Miss. Marguerite Rut","female",4.0,1,1,"PP 9549",16.7,"G6","S"],[1,1,"Bonnell, Miss. Elizabeth","female",58.0,0,0,"113783",26.55,"C103","S"],[0,3,"Saundercock, Mr. William Henry","male",20.0,0,0,"A\\/5. 2151",8.05,null,"S"],[0,3,"Andersson, Mr. Anders Johan","male",39.0,1,5,"347082",31.275,null,"S"],[0,3,"Vestrom, Miss. Hulda Amanda Adolfina","female",14.0,0,0,"350406",7.8542,null,"S"],[1,2,"Hewlett, Mrs. (Mary D Kingcome) ","female",55.0,0,0,"248706",16.0,null,"S"],[0,3,"Rice, Master. Eugene","male",2.0,4,1,"382652",29.125,null,"Q"],[1,2,"Williams, Mr. Charles Eugene","male",null,0,0,"244373",13.0,null,"S"],[0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)","female",31.0,1,0,"345763",18.0,null,"S"],[1,3,"Masselmani, Mrs. Fatima","female",null,0,0,"2649",7.225,null,"C"]]}'

# Read the JSON object and convert it to pandas data frame

In [9]:
df = pd.read_json(jsonObj,orient='split')
df.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

## match the top 5 records from JSON read and actual titanic dataset

In [11]:
#csvObj.head().isin(df.head())
#match = (csvObj[:] != df)[:].any(1)
print(csvObj.head().equals(df.head()))

True

## 2. read the HTML file as given below
http://vincentarelbundock.github.io/Rdatasets/datasets.html

In [58]:
htmlDataset = pd.read_html('http://vincentarelbundock.github.io/Rdatasets/datasets.html',header=0)
#htmlDataset[1]

## create a data frame from the above object

In [59]:
htmlDf = pd.DataFrame(htmlDataset[1])
htmlDf.head(10)

,Package,Item,Title,Rows,Cols,CSV,Doc
0,boot,acme,Monthly Excess Returns,60,3,CSV,DOC
1,boot,aids,Delay in AIDS Reporting in England and Wales,570,6,CSV,DOC
2,boot,aircondit,Failures of Air-conditioning Equipment,12,1,CSV,DOC
3,boot,aircondit7,Failures of Air-conditioning Equipment,24,1,CSV,DOC
4,boot,amis,Car Speeding and Warning Signs,8437,4,CSV,DOC
5,boot,aml,Remission Times for Acute Myelogenous Leukaemia,23,3,CSV,DOC
6,boot,beaver,Beaver Body Temperature Data,100,4,CSV,DOC
7,boot,bigcity,Population of U.S. Cities,49,2,CSV,DOC
8,boot,brambles,Spatial Location of Bramble Canes,823,3,CSV,DOC
9,boot,breslow,Smoking Deaths Among Doctors,10,5,CSV,DOC

## Create URL to JSON file (alternatively this can be a filepath)

In [60]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'
jdf = pd.read_json(url,orient='columns')
jdf.head()

    category            datetime  integer
0          0 2015-01-01 00:00:00        5
1          0 2015-01-01 00:00:01        5
10         0 2015-01-01 00:00:10        5
11         0 2015-01-01 00:00:11        5
12         0 2015-01-01 00:00:12        8